[
  {
    "id": 1,
    "title": "Outline of Responsibilities",
    "description": "Briefly describe the key tasks and duties for this role.",
    "sample_response": "Designing and implementing new software features, collaborating with cross-functional teams for product development, and maintaining existing codebase for optimization and scalability.",
    "additional_info": "Specific technologies used, project scopes, team structure.",
    "purpose": "Job postings, recruitment strategies, defining role expectations."
  },
  {
    "id": 2,
    "title": "Required Skills and Qualifications",
    "description": "List necessary skills and qualifications for a specific role.",
    "sample_response": "Proven experience with SEO/SEM, expertise in content creation and social media strategy, and analytical skills to gauge campaign success and ROI.",
    "additional_info": "Desired years of experience, specific certifications, industry focus.",
    "purpose": "Talent acquisition, candidate screening, competency assessment."
  },
  {
    "id": 3,
    "title": "Desired Soft Skills and Attributes",
    "description": "Describe the soft skills and personal attributes ideal for a specific role.",
    "sample_response": "Strong leadership and communication skills, ability to inspire and motivate team members, and excellent problem-solving and conflict resolution abilities.",
    "additional_info": "Company culture, leadership style, team dynamics.",
    "purpose": "Cultural fit assessment, behavioral interview preparation, leadership training."
  },
  {
    "id": 4,
    "title": "Education and Experience Requirements",
    "description": "State the education and experience required for a specific role.",
    "sample_response": "A bachelor’s degree in Human Resources or a related field and at least five years of HR management experience, including knowledge of labor legislation and employee relations.",
    "additional_info": "Specific degrees or certifications, seniority level, industry-specific experience.",
    "purpose": "Setting candidates' expectations, ensuring qualified applicants, streamlining recruitment process."
  },
  {
    "id": 5,
    "title": "Role in Company’s Big Picture",
    "description": "Explain how a specific position contributes to the overall goals of the company.",
    "sample_response": "Overseeing production processes for efficiency, ensuring product quality standards are met, and leading continuous improvement initiatives to support the company's goal of operational excellence.",
    "additional_info": "Business objectives, manufacturing approaches, strategic priorities.",
    "purpose": "Attracting mission-driven candidates, role clarity, aligning individual contributions with company goals."
  },
  {
    "id": 6,
    "title": "Workplace Environment and Dynamics",
    "description": "Describe the work environment and team dynamics for a specific role.",
    "sample_response": "A collaborative and fast-paced atmosphere, focused on providing exceptional service with a team that values open communication and ongoing learning.",
    "additional_info": "Office or remote settings, team size, customer demographics.",
    "purpose": "Promoting workplace culture, candidate engagement, retention strategies."
  },
  {
    "id": 7,
    "title": "Opportunity for Growth and Learning",
    "description": "Highlight growth and learning opportunities available for a specific role.",
    "sample_response": "Potential for career advancement through on-the-job training, access to sales workshops, and mentorship programs to climb the sales leadership ladder.",
    "additional_info": "Career pathways, training resources, promotion criteria.",
    "purpose": "Increasing job appeal, supporting employee development, creating career roadmaps."
  },
  {
    "id": 8,
    "title": "Specific Project Descriptions",
    "description": "Detail a key project that a newly hired candidate will be handling.",
    "sample_response": "Leading the development and launch of a new mobile application aimed at enhancing user engagement, from initial concept to market deployment.",
    "additional_info": "Project timeline, scope of work, strategic importance.",
    "purpose": "Project-based hiring, role specialization, setting clear objectives."
  },
  {
    "id": 9,
    "title": "Benefits and Compensation Package Information",
    "description": "Provide an overview of the benefits and compensation package for a specific role.",
    "sample_response": "Competitive salary based on experience, comprehensive health coverage, retirement plans, and perks such as work-from-home flexibility and professional development allowances.",
    "additional_info": "Compensation figures, bonus structures, additional perks.",
    "purpose": "Attracting top talent, transparent hiring, employee satisfaction."
  },
  {
    "id": 10,
    "title": "Day-to-Day Worklife Snapshot",
    "description": "Give a snapshot of the daily work life for a specific role.",
    "sample_response": "Crafting engaging content across various digital platforms, collaborating with the SEO team for content optimization, and actively participating in creative brainstorming sessions.",
    "additional_info": "Daily tasks, productivity expectations, team interaction.",
    "purpose": "Setting realistic job expectations, daily schedule communications, applicant preparation."
  },
  {
    "id": 11,
    "title": "Mission & Vision Alignment",
    "description": "Explain how a prospective candidate aligns with the company’s mission and vision.",
    "sample_response": "Seeking a creative visionary ready to translate our mission of social impact into compelling visual narratives that amplify our brand’s visionary commitment to sustainable practices.",
    "additional_info": "Company’s mission, vision statements, brand messaging.",
    "purpose": "Value-driven recruitment, culture fit evaluation, brand consistency."
  }
]